rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
    <vendor>Canaan Inc.</vendor>
    <name>K210</name>
    <version>1.0</version>
    <description>Kendryte K210 64-bit RISC-V CPU</description>

    <addressUnitBits>8</addressUnitBits>
    <width>64</width>
    <size>32</size>
    <access>read-write</access>

    <!-- TODO: remove this -->
    <resetValue>0x00000000</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>

    <peripherals>
        <!-- CLINT -->
        <peripheral>
            <name>CLINT</name>
            <description>Core Local Interruptor</description>
            <groupName>CLINT</groupName>
            <baseAddress>0x02000000</baseAddress>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>msip[%s]</name>
                    <description>Hart software interrupt register</description>
                    <addressOffset>0x0000</addressOffset>
                    <writeConstraint>
                        <range>
                            <minimum>0</minimum>
                            <maximum>1</maximum>
                        </range>
                    </writeConstraint>
                </register>
                <register>
                    <size>64</size>
                    <dim>2</dim>
                    <dimIncrement>0x08</dimIncrement>
                    <name>mtimecmp[%s]</name>
                    <description>Hart time comparator register</description>
                    <addressOffset>0x4000</addressOffset>
                </register>
                <register>
                    <size>64</size>
                    <name>mtime</name>
                    <description>Timer register</description>
                    <addressOffset>0xBFF8</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!-- CLINT -->

        <!-- PLIC -->
        <peripheral>
            <name>PLIC</name>
            <description>Platform-Level Interrupt Controller</description>
            <groupName>PLIC</groupName>
            <baseAddress>0x0C000000</baseAddress>
            <registers>
                <register>
                    <dim>1024</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>priority[%s]</name>
                    <description>Interrupt Source Priority Register</description>
                    <addressOffset>0x000000</addressOffset>
                    <enumeratedValues derivedFrom="threshold">
                    </enumeratedValues>
                </register>
                <register>
                    <dim>32</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>pending[%s]</name>
                    <description>Interrupt Pending Register</description>
                    <addressOffset>0x001000</addressOffset>
                </register>
                <cluster>
                    <name>target_enables[%s]</name>
                    <description>Target Interrupt Enables</description>
                    <addressOffset>0x002000</addressOffset>
                    <dim>4</dim>
                    <dimIncrement>0x80</dimIncrement>
                    <register>
                        <dim>32</dim>
                        <dimIncrement>0x04</dimIncrement>
                        <name>enable[%s]</name>
                        <description>Interrupt Enable Register</description>
                        <addressOffset>0</addressOffset>
                    </register>
                </cluster>
                <cluster>
                    <name>targets[%s]</name>
                    <description>Target Configuration</description>
                    <addressOffset>0x200000</addressOffset>
                    <dim>4</dim>
                    <dimIncrement>0x1000</dimIncrement>
                    <register>
                        <name>threshold</name>
                        <description>Priority Threshold Register</description>
                        <addressOffset>0x0</addressOffset>
                        <fields>
                            <field>
                                <name>priority</name>
                                <msb>2</msb><lsb>0</lsb>
                                <enumeratedValues>
                                    <name>Priority</name>
                                    <enumeratedValue>
                                        <name>Never</name>
                                        <description>Never interrupt</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P1</name>
                                        <description>Priority 1</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P2</name>
                                        <description>Priority 2</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P3</name>
                                        <description>Priority 3</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P4</name>
                                        <description>Priority 4</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P5</name>
                                        <description>Priority 5</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P6</name>
                                        <description>Priority 6</description>
                                        <value>6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>P7</name>
                                        <description>Priority 7</description>
                                        <value>7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>claim</name>
                        <description>Claim/Complete Register</description>
                        <addressOffset>0x4</addressOffset>
                        <range>
                            <minimum>0x00000000</minimum>
                            <maximum>0xFFFFFFFF</maximum>
                        </range>
                    </register>
                    <register>
                        <name>_reserved</name>
                        <description>Padding to make sure targets is an array</description>
                        <addressOffset>0xffc</addressOffset>
                    </register>
                </cluster>
