rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
        </peripheral>
        <!-- PLIC -->

        <!-- UARTHS -->
        <peripheral>
            <name>UARTHS</name>
            <description>High-speed UART</description>
            <groupName>UARTHS</groupName>
            <baseAddress>0x38000000</baseAddress>
            <registers>
                <register>
                    <name>txdata</name>
                    <description>Transmit Data Register</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>data</name>
                            <description>Transmit data</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>full</name>
                            <description>Transmit FIFO full</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>rxdata</name>
                    <description>Receive Data Register</description>
                    <addressOffset>0x04</addressOffset>
                    <fields>
                        <field>
                            <name>data</name>
                            <description>Received data</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>empty</name>
                            <description>Receive FIFO empty</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>txctrl</name>
                    <description>Transmit Control Register</description>
                    <addressOffset>0x08</addressOffset>
                    <fields>
                        <field>
                            <name>txen</name>
                            <description>Transmit enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>nstop</name>
                            <description>Number of stop bits</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>txcnt</name>
                            <description>Transmit watermark level</description>
                            <bitRange>[18:16]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>rxctrl</name>
                    <description>Receive Control Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <fields>
                        <field>
                            <name>rxen</name>
                            <description>Receive enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rxcnt</name>
                            <description>Receive watermark level</description>
                            <bitRange>[18:16]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>ie</name>
                    <description>Interrupt Enable Register</description>
                    <addressOffset>0x10</addressOffset>
                    <fields>
                        <field>
                            <name>txwm</name>
                            <description>Transmit watermark interrupt enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rxwm</name>
                            <description>Receive watermark interrupt enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>ip</name>
                    <description>Interrupt Pending Register</description>
                    <addressOffset>0x14</addressOffset>
                    <fields>
                        <field>
                            <name>txwm</name>
                            <description>Transmit watermark interrupt pending</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rxwm</name>
                            <description>Receive watermark interrupt pending</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>

                <register>
                    <name>div</name>
                    <description>Baud Rate Divisor Register</description>
                    <addressOffset>0x18</addressOffset>
                    <fields>
                        <field>
                            <name>div</name>
                            <description>Baud rate divisor</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
            <interrupt>
                <name>UARTHS</name>
                <value>33</value>
            </interrupt>
        </peripheral>
        <!-- UARTHS -->

        <!-- GPIOHS -->
        <peripheral>
            <name>GPIOHS</name>
            <description>High-speed GPIO</description>
            <groupName>GPIOHS</groupName>
            <baseAddress>0x38001000</baseAddress>
            <registers>
                <register>
                    <name>input_val</name>
                    <description>Input Value Register</description>
                    <addressOffset>0x000</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>input_en</name>
                    <description>Pin Input Enable Register</description>
                    <addressOffset>0x004</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>output_en</name>
                    <description>Pin Output Enable Register</description>
                    <addressOffset>0x008</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>output_val</name>
                    <description>Output Value Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>pullup_en</name>
                    <description>Internal Pull-Up Enable Register</description>
                    <addressOffset>0x010</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>drive</name>
                    <description>Drive Strength Register</description>
                    <addressOffset>0x014</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rise_ie</name>
                    <description>Rise Interrupt Enable Register</description>
                    <addressOffset>0x018</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rise_ip</name>
                    <description>Rise Interrupt Pending Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>fall_ie</name>
                    <description>Fall Interrupt Enable Register</description>
                    <addressOffset>0x020</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>fall_ip</name>
                    <description>Fall Interrupt Pending Register</description>
                    <addressOffset>0x024</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>high_ie</name>
                    <description>High Interrupt Enable Register</description>
                    <addressOffset>0x028</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>high_ip</name>
                    <description>High Interrupt Pending Register</description>
                    <addressOffset>0x02C</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>low_ie</name>
                    <description>Low Interrupt Enable Register</description>
                    <addressOffset>0x030</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>low_ip</name>
                    <description>Low Interrupt Pending Register</description>
                    <addressOffset>0x034</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>iof_en</name>
                    <description>HW I/O Function Enable Register</description>
                    <addressOffset>0x038</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>iof_sel</name>
                    <description>HW I/O Function Select Register</description>
                    <addressOffset>0x03C</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>output_xor</name>
                    <description>Output XOR (invert) Register</description>
                    <addressOffset>0x040</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>32</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
