rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>GPIOHS0</name>
                <value>34</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS1</name>
                <value>35</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS2</name>
                <value>36</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS3</name>
                <value>37</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS4</name>
                <value>38</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS5</name>
                <value>39</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS6</name>
                <value>40</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS7</name>
                <value>41</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS8</name>
                <value>42</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS9</name>
                <value>43</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS10</name>
                <value>44</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS11</name>
                <value>45</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS12</name>
                <value>46</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS13</name>
                <value>47</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS14</name>
                <value>48</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS15</name>
                <value>49</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS16</name>
                <value>50</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS17</name>
                <value>51</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS18</name>
                <value>52</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS19</name>
                <value>53</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS20</name>
                <value>54</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS21</name>
                <value>55</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS22</name>
                <value>56</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS23</name>
                <value>57</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS24</name>
                <value>58</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS25</name>
                <value>59</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS26</name>
                <value>60</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS27</name>
                <value>61</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS28</name>
                <value>62</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS29</name>
                <value>63</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS30</name>
                <value>64</value>
            </interrupt>
            <interrupt>
                <name>GPIOHS31</name>
                <value>65</value>
            </interrupt>
        </peripheral>
        <!-- GPIOHS -->

        <!-- KPU -->
        <peripheral>
            <name>KPU</name>
            <description>Neural Network Accelerator</description>
            <groupName>KPU</groupName>
            <baseAddress>0x40800000</baseAddress>
            <!-- TODO <size>64</size> -->
            <registers>
                <register>
                    <name>layer_argument_fifo</name>
                    <description>Layer arguments FIFO: each layer is defined by writing 12 successive argument values to this register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>64</size>
                </register>
                <register>
                    <name>interrupt_status</name>
                    <description>Interrupt status</description>
                    <addressOffset>0x08</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>calc_done</name>
                            <description>Interrupt raised when calculation is done</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>layer_cfg_almost_empty</name>
                            <description>Interrupt raised when layer arguments FIFO almost empty</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>layer_cfg_almost_full</name>
                            <description>Interrupt raised when layer arguments FIFO almost full</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="interrupt_status">
                    <name>interrupt_raw</name>
                    <description>Interrupt raw</description>
                    <addressOffset>0x10</addressOffset>
                    <size>64</size>
                </register>
                <register derivedFrom="interrupt_status">
                    <name>interrupt_mask</name>
                    <description>Interrupt mask: 0 enables the interrupt, 1 masks the interrupt</description>
                    <addressOffset>0x18</addressOffset>
                    <size>64</size>
                </register>
                <register derivedFrom="interrupt_status">
                    <name>interrupt_clear</name>
                    <description>Interrupt clear: write 1 to a bit to clear interrupt</description>
                    <addressOffset>0x20</addressOffset>
                    <size>64</size>
                </register>
                <register>
                    <name>fifo_threshold</name>
                    <description>FIFO threshold</description>
                    <addressOffset>0x28</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>full_threshold</name>
                            <description>FIFO full threshold</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>empty_threshold</name>
                            <description>FIFO empty threshold</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>fifo_data_out</name>
                    <description>FIFO data output</description>
                    <addressOffset>0x30</addressOffset>
                    <size>64</size>
                </register>
                <register>
                    <name>fifo_ctrl</name>
                    <description>FIFO control</description>
                    <addressOffset>0x38</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>dma_fifo_flush_n</name>
                            <description>Flush DMA FIFO</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>gs_fifo_flush_n</name>
                            <description>Flush GS FIFO</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>cfg_fifo_flush_n</name>
                            <description>Flush configuration FIFO</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>cmd_fifo_flush_n</name>
                            <description>Flush command FIFO</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>resp_fifo_flush_n</name>
                            <description>Flush response FIFO</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>eight_bit_mode</name>
                    <description>Eight bit mode</description>
                    <addressOffset>0x40</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>eight_bit_mode</name>
                            <description>Use 8-bit instead of 16-bit precision if set</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
