rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>FFT</name>
                <value>26</value>
            </interrupt>
        </peripheral>
        <!-- FFT -->

        <!-- DMAC -->
        <peripheral>
            <name>DMAC</name>
            <description>Direct Memory Access Controller</description>
            <groupName>DMAC</groupName>
            <baseAddress>0x50000000</baseAddress>
            <!-- TODO <size>64</size> -->
            <registers>
                <register>
                    <name>id</name>
                    <description>ID Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>64</size>
                </register>
                <register>
                    <name>compver</name>
                    <description>COMPVER Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>64</size>
                </register>
                <register>
                    <name>cfg</name>
                    <description>Configure Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>dmac_en</name>
                            <description>Enable DMAC</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>int_en</name>
                            <description>Globally enable interrupt generation</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <!-- reserved bit 2..63 -->
                    </fields>
                </register>
                <register>
                    <name>chen</name>
                    <description>Channel Enable Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>ch%s_en</name>
                            <description>Enable channel %s</description>
                            <bitRange>[0:0]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 6..7 -->
                        <field>
                            <name>ch%s_en_we</name>
                            <description>Write enable channel %s</description>
                            <bitRange>[8:8]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 14..15 -->
                        <field>
                            <name>ch%s_susp</name>
                            <description>Suspend request channel %s</description>
                            <bitRange>[16:16]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 22.23 -->
                        <field>
                            <name>ch%s_susp_we</name>
                            <description>Enable write to ch%s_susp bit</description>
                            <bitRange>[24:24]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 30..31 -->
                        <field>
                            <name>ch%s_abort</name>
                            <description>Abort request channel %s</description>
                            <bitRange>[32:32]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 38..39 -->
                        <field>
                            <name>ch%s_abort_we</name>
                            <description>Enable write to ch%s_abort bit</description>
                            <bitRange>[40:40]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 46..63 -->
                    </fields>
                </register>
                <!-- reserved: 0x20..0x2f -->
                <register>
                    <name>intstatus</name>
                    <description>Interrupt Status Register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>ch%s_intstat</name>
                            <description>Channel %s interrupt bit</description>
                            <bitRange>[0:0]</bitRange>
                            <dim>6</dim>
                            <dimIncrement>1</dimIncrement>
                            <dimIndex>1-6</dimIndex>
                        </field>
                        <!-- reserved bit 6..15 -->
                        <field>
                            <name>commonreg_intstat</name>
                            <description>Common register status bit</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <!-- reserved bit 17..63 -->
                    </fields>
                </register>
                <register>
                    <name>com_intclear</name>
                    <description>Common Interrupt Clear Register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>slvif_dec_err</name>
                            <description>Clear slvif_dec_err interrupt in com_intstatus</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wr2ro_err</name>
                            <description>Clear slvif_wr2ro_err interrupt in com_intstatus</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>slvif_rd2wo_err</name>
                            <description>Clear slvif_rd2wo_err interrupt in com_intstatus</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wronhold_err</name>
                            <description>Clear slvif_wronhold_err interrupt in com_intstatus</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <!-- reserved bit 4..7 -->
                        <field>
                            <name>slvif_undefinedreg_dec_err</name>
                            <description>Clear slvif_undefinedreg_dec_err in com_intstatus</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <!-- reserved bit 9..63 -->
                    </fields>
                </register>
                <register>
                    <name>com_intstatus_en</name>
                    <description>Common Interrupt Status Enable Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>slvif_dec_err</name>
                            <description>Slave Interface Common Register Decode Error</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wr2ro_err</name>
                            <description>Slave Interface Common Register Write to Read only Error</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>slvif_rd2wo_err</name>
                            <description>Slave Interface Common Register Read to Write-only Error</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wronhold_err</name>
                            <description>Slave Interface Common Register Write On Hold Error</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <!-- reserved bit 4..7 -->
                        <field>
                            <name>slvif_undefinedreg_dec_err</name>
                            <description>Slave Interface Undefined Register Decode Error</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <!-- reserved bit 9..63 -->
                    </fields>
                </register>
                <register>
                    <name>com_intsignal_en</name>
                    <description>Common Interrupt Signal Enable Register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>slvif_dec_err</name>
                            <description>Slave Interface Common Register Decode Error</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wr2ro_err</name>
                            <description>Slave Interface Common Register Write to Read only Error</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>slvif_rd2wo_err</name>
                            <description>Slave Interface Common Register Read to Write-only Error</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wronhold_err</name>
                            <description>Slave Interface Common Register Write On Hold Error</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <!-- reserved bit 4..7 -->
                        <field>
                            <name>slvif_undefinedreg_dec_err</name>
                            <description>Slave Interface Undefined Register Decode Error</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <!-- reserved bit 9..63 -->
                    </fields>
                </register>
                <register>
                    <name>com_intstatus</name>
                    <description>Common Interrupt Status</description>
                    <addressOffset>0x50</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>slvif_dec_err</name>
                            <description>Slave Interface Common Register Decode Error</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wr2ro_err</name>
                            <description>Slave Interface Common Register Write to Read only Error</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>slvif_rd2wo_err</name>
                            <description>Slave Interface Common Register Read to Write-only Error</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>slvif_wronhold_err</name>
                            <description>Slave Interface Common Register Write On Hold Error</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <!-- reserved bit 4..7 -->
                        <field>
                            <name>slvif_undefinedreg_dec_err</name>
                            <description>Slave Interface Undefined Register Decode Error</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <!-- reserved bit 9..63 -->
                    </fields>
                </register>
                <register>
                    <name>reset</name>
                    <description>Reset register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>64</size>
                    <fields>
                        <field>
                            <name>rst</name>
                            <description>DMAC reset request bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <!-- reserved bit 1..63 -->
                    </fields>
                </register>
                <!-- reserved: 0x60..0xff -->
                <cluster>
                    <name>channel[%s]</name>
                    <description>Channel configuration</description>
                    <dim>6</dim>
                    <addressOffset>0x100</addressOffset>
                    <dimIncrement>0x100</dimIncrement>
                    <size>64</size>
                    <register>
                        <name>sar</name>
                        <description>SAR Address Register</description>
                        <addressOffset>0x00</addressOffset>
                    </register>
                    <register>
                        <name>dar</name>
                        <description>DAR Address Register</description>
                        <addressOffset>0x08</addressOffset>
                    </register>
                    <register>
                        <name>block_ts</name>
                        <description>Block Transfer Size Register</description>
                        <addressOffset>0x10</addressOffset>
                        <fields>
                            <field>
                                <name>block_ts</name>
                                <description>Block transfer size</description>
                                <bitRange>[21:0]</bitRange>
                            </field>
                            <!-- reserved bit 22..63 -->
                        </fields>
                    </register>
