rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                    <register>
                        <name>ctl</name>
                        <description>Control Register</description>
                        <addressOffset>0x18</addressOffset>
                        <fields>
                            <field>
                                <name>sms</name>
                                <description>Source master select</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <name>MASTER_SELECT</name>
                                    <enumeratedValue>
                                        <name>axi_master_1</name>
                                        <description>AXI master 1</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>axi_master_2</name>
                                        <description>AXI master 2</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <!-- reserved bit 1 -->
                            <field>
                                <name>dms</name>
                                <description>Destination master select</description>
                                <bitRange>[2:2]</bitRange>
                                <enumeratedValues derivedFrom="MASTER_SELECT"/>
                            </field>
                            <!-- reserved bit 3 -->
                            <field>
                                <name>sinc</name>
                                <description>Source address increment</description>
                                <bitRange>[4:4]</bitRange>
                                <enumeratedValues>
                                    <name>INCREMENT</name>
                                    <enumeratedValue>
                                        <name>increment</name>
                                        <description>Increment address</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>nochange</name>
                                        <description>Don't increment address</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <!-- reserved bit 5 -->
                            <field>
                                <name>dinc</name>
                                <description>Destination address increment</description>
                                <bitRange>[6:6]</bitRange>
                                <enumeratedValues derivedFrom="INCREMENT"/>
                            </field>
                            <!-- reserved bit 7 -->
                            <field>
                                <name>src_tr_width</name>
                                <description>Source transfer width</description>
                                <bitRange>[10:8]</bitRange>
                                <enumeratedValues>
                                    <name>TRANSFER_WIDTH</name>
                                    <enumeratedValue>
                                        <name>width_8</name>
                                        <description>8 bits</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_16</name>
                                        <description>16 bits</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_32</name>
                                        <description>32 bits</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_64</name>
                                        <description>64 bits</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_128</name>
                                        <description>128 bits</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_256</name>
                                        <description>256 bits</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>width_512</name>
                                        <description>512 bits</description>
                                        <value>6</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>dst_tr_width</name>
                                <description>Destination transfer width</description>
                                <bitRange>[13:11]</bitRange>
                                <enumeratedValues derivedFrom="TRANSFER_WIDTH"/>
                            </field>
                            <field>
                                <name>src_msize</name>
                                <description>Source burst transaction length</description>
                                <bitRange>[17:14]</bitRange>
                                <enumeratedValues>
                                    <name>BURST_LENGTH</name>
                                    <enumeratedValue>
                                        <name>length_1</name>
                                        <description>1 data item</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_4</name>
                                        <description>4 data items</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_8</name>
                                        <description>8 data items</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_16</name>
                                        <description>16 data items</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_32</name>
                                        <description>32 data items</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_64</name>
                                        <description>64 data items</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_128</name>
                                        <description>128 data items</description>
                                        <value>6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_256</name>
                                        <description>256 data items</description>
                                        <value>7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_512</name>
                                        <description>512 data items</description>
                                        <value>8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>length_1024</name>
                                        <description>1024 data items</description>
                                        <value>9</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>dst_msize</name>
                                <description>Destination burst transaction length</description>
                                <bitRange>[21:18]</bitRange>
                                <enumeratedValues derivedFrom="BURST_LENGTH" />
                            </field>
                            <!-- reserved bit 22..29 -->
                            <field>
                                <name>nonposted_lastwrite_en</name>
                                <description>Non Posted Last Write Enable (posted writes may be used till the end of the block)</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <!-- reserved bit 31..37 -->
                            <field>
                                <name>arlen_en</name>
                                <description>Source burst length enable</description>
                                <bitRange>[38:38]</bitRange>
                            </field>
                            <field>
                                <name>arlen</name>
                                <description>Source burst length</description>
                                <bitRange>[46:39]</bitRange>
                            </field>
                            <field>
                                <name>awlen_en</name>
                                <description>Destination burst length enable</description>
                                <bitRange>[47:47]</bitRange>
                            </field>
                            <field>
                                <name>awlen</name>
                                <description>Destination burst length</description>
                                <bitRange>[55:48]</bitRange>
                            </field>
                            <field>
                                <name>src_stat_en</name>
                                <description>Source status enable</description>
                                <bitRange>[56:56]</bitRange>
                            </field>
                            <field>
                                <name>dst_stat_en</name>
                                <description>Destination status enable</description>
                                <bitRange>[57:57]</bitRange>
                            </field>
                            <field>
                                <name>ioc_blktfr</name>
                                <description>Interrupt completion of block transfer</description>
                                <bitRange>[58:58]</bitRange>
                            </field>
                            <!-- reserved bit 59..61 -->
                            <field>
                                <name>shadowreg_or_lli_last</name>
                                <description>Last shadow linked list item (indicates shadowreg/LLI content is the last one)</description>
                                <bitRange>[62:62]</bitRange>
                            </field>
                            <field>
                                <name>shadowreg_or_lli_valid</name>
                                <description>last shadow linked list item valid (indicate shadowreg/LLI content is valid)</description>
                                <bitRange>[63:63]</bitRange>
                            </field>
                        </fields>
                    </register>
