rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                    <register>
                        <name>cfg</name>
                        <description>Configure Register</description>
                        <addressOffset>0x20</addressOffset>
                        <fields>
                            <field>
                                <name>src_multblk_type</name>
                                <description>Source multi-block transfer type</description>
                                <bitRange>[1:0]</bitRange>
                                <enumeratedValues>
                                    <name>MULTIBLK_TRANSFER_TYPE</name>
                                    <enumeratedValue>
                                        <name>contiguous</name>
                                        <description>Continuous multi-block type</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>reload</name>
                                        <description>Reload multi-block type</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>shadow_register</name>
                                        <description>Shadow register based multi-block type</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>linked_list</name>
                                        <description>Linked list based multi-block type</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>dst_multblk_type</name>
                                <description>Destination multi-block transfer type</description>
                                <bitRange>[3:2]</bitRange>
                                <enumeratedValues derivedFrom="MULTIBLK_TRANSFER_TYPE" />
                            </field>
                            <!-- reserved bit 4..31 -->
                            <field>
                                <name>tt_fc</name>
                                <description>Transfer type and flow control</description>
                                <bitRange>[34:32]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>mem2mem_dma</name>
                                        <description>Transfer memory to memory and flow controller is DMAC</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>mem2prf_dma</name>
                                        <description>Transfer memory to peripheral and flow controller is DMAC</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>prf2mem_dma</name>
                                        <description>Transfer peripheral to memory and flow controller is DMAC</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>prf2prf_dma</name>
                                        <description>Transfer peripheral to peripheral and flow controller is DMAC</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>prf2mem_prf</name>
                                        <description>Transfer peripheral to memory and flow controller is source peripheral</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>prf2prf_srcprf</name>
                                        <description>Transfer peripheral to peripheral and flow controller is source peripheral</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>mem2prf_prf</name>
                                        <description>Transfer memory to peripheral and flow controller is destination peripheral</description>
                                        <value>6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>prf2prf_dstprf</name>
                                        <description>Transfer peripheral to peripheral and flow controller is destination peripheral</description>
                                        <value>7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>hs_sel_src</name>
                                <description>Source software or hardware handshaking select</description>
                                <bitRange>[35:35]</bitRange>
                                <enumeratedValues>
                                    <name>HANDSHAKING</name>
                                    <enumeratedValue>
                                        <name>hardware</name>
                                        <description>Hardware handshaking is used</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>software</name>
                                        <description>Software handshaking is used</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>hs_sel_dst</name>
                                <description>Destination software or hardware handshaking select</description>
                                <bitRange>[36:36]</bitRange>
                                <enumeratedValues derivedFrom="HANDSHAKING" />
                            </field>
                            <field>
                                <name>src_hwhs_pol</name>
                                <description>Source hardware handshaking interface polarity</description>
                                <bitRange>[37:37]</bitRange>
                                <enumeratedValues>
                                    <name>POLARITY</name>
                                    <enumeratedValue>
                                        <name>active_high</name>
                                        <description>Active high</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>active_low</name>
                                        <description>Active low</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>dst_hwhs_pol</name>
                                <description>Destination hardware handshaking interface polarity</description>
                                <bitRange>[38:38]</bitRange>
                                <enumeratedValues derivedFrom="POLARITY" />
                            </field>
                            <field>
                                <name>src_per</name>
                                <description>Assign a hardware handshaking interface to source of channel</description>
                                <bitRange>[42:39]</bitRange>
                            </field>
                            <!-- reserved bit 43 -->
                            <field>
                                <name>dst_per</name>
                                <description>Assign a hardware handshaking interface to destination of channel</description>
                                <bitRange>[47:44]</bitRange>
                            </field>
                            <!-- reserved bit 48 -->
                            <field>
                                <name>ch_prior</name>
                                <description>Channel priority (7 is highest, 0 is lowest)</description>
                                <bitRange>[51:49]</bitRange>
                            </field>
                            <field>
                                <name>lock_ch</name>
                                <description>Channel lock bit</description>
                                <bitRange>[52:52]</bitRange>
                            </field>
                            <field>
                                <name>lock_ch_l</name>
                                <description>Channel lock level</description>
                                <bitRange>[54:53]</bitRange>
                                <enumeratedValues>
                                    <enumeratedValue>
                                        <name>dma_transfer</name>
                                        <description>Duration of channel is locked for entire DMA transfer</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>block_transfer</name>
                                        <description>Duration of channel is locked for current block transfer</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>transaction</name>
                                        <description>Duration of channel is locked for current transaction</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                            <field>
                                <name>src_osr_lmt</name>
                                <description>Source outstanding request limit</description>
                                <bitRange>[58:55]</bitRange>
                            </field>
                            <field>
                                <name>dst_osr_lmt</name>
                                <description>Destination outstanding request limit</description>
                                <bitRange>[62:59]</bitRange>
                            </field>
                            <!-- reserved bit 63 -->
                        </fields>
                    </register>
                    <register>
                        <name>llp</name>
                        <description>Linked List Pointer register</description>
                        <addressOffset>0x28</addressOffset>
                        <fields>
                            <field>
                                <name>lms</name>
                                <description>LLI master select</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues derivedFrom="ctl.sms.MASTER_SELECT" />
                            </field>
                            <!-- reserved bit 1..5 -->
                            <field>
                                <name>loc</name>
                                <description>Starting address memeory of LLI block</description>
                                <bitRange>[63:6]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>status</name>
                        <description>Channel Status Register</description>
                        <addressOffset>0x30</addressOffset>
                        <fields>
                            <field>
                                <name>cmpltd_blk_size</name>
                                <description>Completed block transfer size</description>
                                <bitRange>[21:0]</bitRange>
                            </field>
                            <!-- reserved bit 22..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>swhssrc</name>
                        <description>Channel Software handshake Source Register</description>
                        <addressOffset>0x38</addressOffset>
                        <fields>
                            <field>
                                <name>req</name>
                                <description>Software handshake request for channel source</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>req_we</name>
                                <description>Write enable bit for software handshake request</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>sglreq</name>
                                <description>Software handshake single request for channel source</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>sglreq_we</name>
                                <description>Write enable bit for software handshake</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>lst</name>
                                <description>Software handshake last request for channel source</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>lst_we</name>
                                <description>Write enable bit for software handshake last request</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <!-- reserved bits 6..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>swhsdst</name>
                        <description>Channel Software handshake Destination Register</description>
                        <addressOffset>0x40</addressOffset>
                        <fields>
                            <field>
                                <name>req</name>
                                <description>Software handshake request for channel destination</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>req_we</name>
                                <description>Write enable bit for software handshake request</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>sglreq</name>
                                <description>Software handshake single request for channel destination</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>sglreq_we</name>
                                <description>Write enable bit for software handshake</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>lst</name>
                                <description>Software handshake last request for channel destination</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>lst_we</name>
                                <description>Write enable bit for software handshake last request</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <!-- reserved bits 6..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>blk_tfr</name>
                        <description>Channel Block Transfer Resume Request Register</description>
                        <addressOffset>0x48</addressOffset>
                        <fields>
                            <field>
                                <name>resumereq</name>
                                <description>Block transfer resume request</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <!-- reserved bits 1..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>axi_id</name>
                        <description>Channel AXI ID Register</description>
                        <addressOffset>0x50</addressOffset>
                    </register>
                    <register>
                        <name>axi_qos</name>
                        <description>AXI QOS Register</description>
                        <addressOffset>0x58</addressOffset>
                    </register>
