rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                    <!-- reserved: 0x60..0x7f -->
                    <register>
                        <name>intstatus_en</name>
                        <description>Interrupt Status Enable Register</description>
                        <addressOffset>0x80</addressOffset>
                        <fields>
                            <field>
                                <name>block_tfr_done</name>
                                <description>Block transfer done</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>tfr_done</name>
                                <description>Transfer done</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <!-- reserved bit 2 -->
                            <field>
                                <name>src_transcomp</name>
                                <description>Source transaction complete</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>dst_transcomp</name>
                                <description>Destination transaction complete</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>src_dec_err</name>
                                <description>Source Decode Error</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>dst_dec_err</name>
                                <description>Destination Decode Error</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>src_slv_err</name>
                                <description>Source Slave Error</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>dst_slv_err</name>
                                <description>Destination Slave Error</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_dec_err</name>
                                <description>LLI Read Decode Error Status Enable</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_dec_err</name>
                                <description>LLI WRITE Decode Error</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_slv_err</name>
                                <description>LLI Read Slave Error</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_slv_err</name>
                                <description>LLI WRITE Slave Error</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <!-- reserved bit 13..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>intstatus</name>
                        <description>Channel Interrupt Status Register</description>
                        <addressOffset>0x88</addressOffset>
                        <fields>
                            <field>
                                <name>block_tfr_done</name>
                                <description>Block transfer done</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>tfr_done</name>
                                <description>Transfer done</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <!-- reserved bit 2 -->
                            <field>
                                <name>src_transcomp</name>
                                <description>Source transaction complete</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>dst_transcomp</name>
                                <description>Destination transaction complete</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>src_dec_err</name>
                                <description>Source Decode Error</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>dst_dec_err</name>
                                <description>Destination Decode Error</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>src_slv_err</name>
                                <description>Source Slave Error</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>dst_slv_err</name>
                                <description>Destination Slave Error</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_dec_err</name>
                                <description>LLI Read Decode Error Status Enable</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_dec_err</name>
                                <description>LLI WRITE Decode Error</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_slv_err</name>
                                <description>LLI Read Slave Error</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_slv_err</name>
                                <description>LLI WRITE Slave Error</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <!-- reserved bit 13..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>intsignal_en</name>
                        <description>Interrupt Signal Enable Register</description>
                        <addressOffset>0x90</addressOffset>
                        <fields>
                            <field>
                                <name>block_tfr_done</name>
                                <description>Block transfer done</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>tfr_done</name>
                                <description>Transfer done</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <!-- reserved bit 2 -->
                            <field>
                                <name>src_transcomp</name>
                                <description>Source transaction complete</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>dst_transcomp</name>
                                <description>Destination transaction complete</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>src_dec_err</name>
                                <description>Source Decode Error</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>dst_dec_err</name>
                                <description>Destination Decode Error</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>src_slv_err</name>
                                <description>Source Slave Error</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>dst_slv_err</name>
                                <description>Destination Slave Error</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_dec_err</name>
                                <description>LLI Read Decode Error Status Enable</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_dec_err</name>
                                <description>LLI WRITE Decode Error</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_slv_err</name>
                                <description>LLI Read Slave Error</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_slv_err</name>
                                <description>LLI WRITE Slave Error</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <!-- reserved bit 13..63 -->
                        </fields>
                    </register>
                    <register>
                        <name>intclear</name>
                        <description>Interrupt Clear Register</description>
                        <addressOffset>0x98</addressOffset>
                        <fields>
                            <field>
                                <name>block_tfr_done</name>
                                <description>Block transfer done</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>tfr_done</name>
                                <description>Transfer done</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <!-- reserved bit 2 -->
                            <field>
                                <name>src_transcomp</name>
                                <description>Source transaction complete</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>dst_transcomp</name>
                                <description>Destination transaction complete</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>src_dec_err</name>
                                <description>Source Decode Error</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>dst_dec_err</name>
                                <description>Destination Decode Error</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>src_slv_err</name>
                                <description>Source Slave Error</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>dst_slv_err</name>
                                <description>Destination Slave Error</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_dec_err</name>
                                <description>LLI Read Decode Error Status Enable</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_dec_err</name>
                                <description>LLI WRITE Decode Error</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>lli_rd_slv_err</name>
                                <description>LLI Read Slave Error</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>lli_wr_slv_err</name>
                                <description>LLI WRITE Slave Error</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <!-- reserved bit 13..63 -->
                        </fields>
                    </register>
                    <!-- reserved: 0xa0..0xff -->
                    <register>
                        <name>_reserved</name>
                        <description>Padding to make structure size 256 bytes so that channels[] is an array</description>
                        <addressOffset>0xf8</addressOffset>
                    </register>
                </cluster>
