rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>DMA0</name>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>DMA1</name>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>DMA2</name>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>DMA3</name>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>DMA4</name>
                <value>31</value>
            </interrupt>
            <interrupt>
                <name>DMA5</name>
                <value>32</value>
            </interrupt>
        </peripheral>
        <!-- DMAC -->

        <!-- GPIO -->
        <peripheral>
            <name>GPIO</name>
            <description>General Purpose Input/Output Interface</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x50200000</baseAddress>
            <registers>
                <register>
                    <name>data_output</name>
                    <description>Data (output) registers</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>8</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>direction</name>
                    <description>Data direction registers</description>
                    <addressOffset>0x04</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>8</dim>
                            <dimIncrement>1</dimIncrement>
                            <enumeratedValues>
                                <name>DIRECTION</name>
                                <enumeratedValue>
                                    <name>input</name>
                                    <description>Pin is input</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>output</name>
                                    <description>Pin is output</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>source</name>
                    <description>Data source registers</description>
                    <addressOffset>0x08</addressOffset>
                </register>
                <register>
                    <name>interrupt_enable</name>
                    <description>Interrupt enable/disable registers</description>
                    <addressOffset>0x30</addressOffset>
                </register>
                <register>
                    <name>interrupt_mask</name>
                    <description>Interrupt mask registers</description>
                    <addressOffset>0x34</addressOffset>
                </register>
                <register>
                    <name>interrupt_level</name>
                    <description>Interrupt level registers</description>
                    <addressOffset>0x38</addressOffset>
                </register>
                <register>
                    <name>interrupt_polarity</name>
                    <description>Interrupt polarity registers</description>
                    <addressOffset>0x3c</addressOffset>
                </register>
                <register>
                    <name>interrupt_status</name>
                    <description>Interrupt status registers</description>
                    <addressOffset>0x40</addressOffset>
                </register>
                <register>
                    <name>interrupt_status_raw</name>
                    <description>Raw interrupt status registers</description>
                    <addressOffset>0x44</addressOffset>
                </register>
                <register>
                    <name>interrupt_debounce</name>
                    <description>Interrupt debounce registers</description>
                    <addressOffset>0x48</addressOffset>
                </register>
                <register>
                    <name>interrupt_clear</name>
                    <description>Registers for clearing interrupts</description>
                    <addressOffset>0x4c</addressOffset>
                </register>
                <register>
                    <name>data_input</name>
                    <description>External port (data input) registers</description>
                    <addressOffset>0x50</addressOffset>
                    <fields>
                        <field>
                            <name>pin%s</name>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <dim>8</dim>
                            <dimIncrement>1</dimIncrement>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sync_level</name>
                    <description>Sync level registers</description>
                    <addressOffset>0x60</addressOffset>
                </register>
                <register>
                    <name>id_code</name>
                    <description>ID code</description>
                    <addressOffset>0x64</addressOffset>
                </register>
                <register>
                    <name>interrupt_bothedge</name>
                    <description>Interrupt both edge type</description>
                    <addressOffset>0x68</addressOffset>
                </register>
