rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>SPI3</name>
                <value>4</value>
            </interrupt>
        </peripheral>
        <!-- SPI3 -->

        <!-- I2S0 -->
        <peripheral>
            <name>I2S0</name>
            <description>Inter-Integrated Sound Interface 0</description>
            <groupName>I2S</groupName>
            <baseAddress>0x50250000</baseAddress>
            <registers>
                <!-- TODO -->
                <register>
                    <name>ier</name>
                    <description>Enable Register</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>ien</name>
                            <description>I2S Enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>irer</name>
                    <description>Receiver Block Enable Register</description>
                    <addressOffset>0x04</addressOffset>
                    <fields>
                        <field>
                            <name>rxen</name>
                            <description>Receiver block enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>iter</name>
                    <description>Transmitter Block Enable Register</description>
                    <addressOffset>0x08</addressOffset>
                    <fields>
                        <field>
                            <name>txen</name>
                            <description>Transmitter block enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>cer</name>
                    <description>Clock Generation enable</description>
                    <addressOffset>0x0c</addressOffset>
                    <fields>
                        <field>
                            <name>clken</name>
                            <description>Transmitter block enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ccr</name>
                    <description>Clock Configuration Register</description>
                    <addressOffset>0x10</addressOffset>
                    <fields>
                        <field>
                            <name>clk_gate</name>
                            <description>Gating of sclk</description>
                            <bitRange>[2:0]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>no</name>
                                    <description>Clock gating is disabled</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles12</name>
                                    <description>Gating after 12 sclk cycles</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles16</name>
                                    <description>Gating after 16 sclk cycles</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles20</name>
                                    <description>Gating after 20 sclk cycles</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles24</name>
                                    <description>Gating after 24 sclk cycles</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>clk_word_size</name>
                            <description>The number of sclk cycles for which the word select line stayd in the left aligned or right aligned mode</description>
                            <bitRange>[4:3]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>cycles16</name>
                                    <description>16 sclk cycles</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles24</name>
                                    <description>24 sclk cycles</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>cycles32</name>
                                    <description>32 sclk cycles</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>align_mode</name>
                            <description>Alignment mode setting</description>
                            <bitRange>[7:5]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>standard</name>
                                    <description>Standard I2S format</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>right</name>
                                    <description>Right aligned format</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>left</name>
                                    <description>Left aligned format</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>dma_tx_en</name>
                            <description>DMA transmit enable control</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>dma_rx_en</name>
                            <description>DMA receive enable control</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>dma_divide_16</name>
                            <description>Split 32bit data to two 16 bit data and filled in left and right channel. Used with dma_tx_en or dma_rx_en</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>sign_expand_en</name>
                            <description>SIGN_EXPAND_EN</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rxffr</name>
                    <description>Receiver Block FIFO Reset Register</description>
                    <addressOffset>0x14</addressOffset>
                    <fields>
                        <field>
                            <name>rxffr</name>
                            <description>Receiver FIFO reset</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>FLUSH</name>
                                <enumeratedValue>
                                    <name>not_flush</name>
                                    <description>Not flush FIFO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>flush</name>
                                    <description>Flush FIFO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>txffr</name>
                    <description>Transmitter Block FIFO Reset Register</description>
                    <addressOffset>0x18</addressOffset>
                    <fields>
                        <field>
                            <name>rxffr</name>
                            <description>Transmitter FIFO reset</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues derivedFrom = "rxffr.rxffr.FLUSH">
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <cluster>
                    <name>channel%s</name>
                    <description>Channel cluster</description>
                    <addressOffset>0x20</addressOffset>
                    <dim>4</dim>
                    <dimIndex>0-3</dimIndex>
                    <dimIncrement>0x40</dimIncrement>
                    <register>
                        <!-- TODO -->
                        <name>left_rxtx</name>
                        <description>Left Receive or Left Transmit Register</description>
                        <addressOffset>0x00</addressOffset>
                    </register>
                    <register>
                        <name>right_rxtx</name>
                        <!-- TODO -->
                        <description>Right Receive or Right Transmit Register</description>
                        <addressOffset>0x04</addressOffset>
                    </register>
                    <register>
                        <name>rer</name>
                        <description>Receive Enable Register</description>
                        <addressOffset>0x08</addressOffset>
                        <fields>
                            <field>
                                <name>rxchenx</name>
                                <description>Receive channel enable/disable</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>ter</name>
                        <description>Transmit Enable Register</description>
                        <addressOffset>0x0c</addressOffset>
                        <fields>
                            <field>
                                <name>txchenx</name>
                                <description>Transmit channel enable/disable</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>rcr</name>
                        <description>Receive Configuration Register</description>
                        <addressOffset>0x10</addressOffset>
                        <fields>
                            <field>
                                <name>wlen</name>
                                <description>Desired data resolution of receiver</description>
                                <bitRange>[2:0]</bitRange>
                                <enumeratedValues>
                                    <name>WLEN</name>
                                    <enumeratedValue>
                                        <name>ignore</name>
                                        <description>Ignore the word length</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>resolution12</name>
                                        <description>12-bit data resolution of the receiver</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>resolution16</name>
                                        <description>16-bit data resolution of the receiver</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>resolution20</name>
                                        <description>20-bit data resolution of the receiver</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>resolution24</name>
                                        <description>24-bit data resolution of the receiver</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>resolution32</name>
                                        <description>32-bit data resolution of the receiver</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>tcr</name>
                        <description>Transmit Configuration Register</description>
                        <addressOffset>0x14</addressOffset>
                        <fields>
                            <field>
                                <name>wlen</name>
                                <description>Desired data resolution of transmitter</description>
                                <bitRange>[2:0]</bitRange>
                                <enumeratedValues derivedFrom = "rcr.wlen.WLEN">
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>isr</name>
                        <description>Interrupt Status Register</description>
                        <addressOffset>0x18</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>rxda</name>
                                <description>Status of receiver data avaliable interrupt</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>rxfo</name>
                                <description>Status of data overrun interrupt for RX channel</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>txfe</name>
                                <description>Status of transmit empty triger interrupt</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>txfo</name>
                                <description>Status of data overrun interrupt for the TX channel</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>imr</name>
                        <description>Interrupt Mask Register</description>
                        <addressOffset>0x1c</addressOffset>
                        <fields>
                            <field>
                                <name>rxdam</name>
                                <description>Mask RX FIFO data avaliable interrupt</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>rxfom</name>
                                <description>Mask RX FIFO overrun interrupt</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>txfem</name>
                                <description>Mask TX FIFO empty interrupt</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>txfom</name>
                                <description>Mask TX FIFO overrun interrupt</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>ror</name>
                        <description>Receive Overrun Register</description>
                        <addressOffset>0x20</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>rxcho</name>
                                <description>Read this bit to clear RX FIFO data overrun interrupt. 0x0 for RX FIFO write valid, 0x1 for RX FIFO write overrun</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>tor</name>
                        <description>Transmit Overrun Register</description>
                        <addressOffset>0x24</addressOffset>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>txcho</name>
                                <description>Read this bit to clear TX FIFO data overrun interrupt. 0x0 for TX FIFO write valid, 0x1 for TX FIFO write overrun</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                        </fields>
                    </register>
