rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                    <register>
                        <name>rfcr</name>
                        <description>Receive FIFO Configuration Register</description>
                        <addressOffset>0x28</addressOffset>
                        <fields>
                            <field>
                                <name>rxchdt</name>
                                <description>Trigger level in the RX FIFO at which the receiver data available interrupt generate</description>
                                <bitRange>[3:0]</bitRange>
                                <enumeratedValues>
                                    <name>LEVEL</name>
                                    <enumeratedValue>
                                        <name>level1</name>
                                        <description>Interrupt trigger when FIFO level is 1</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level2</name>
                                        <description>Interrupt trigger when FIFO level is 2</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level3</name>
                                        <description>Interrupt trigger when FIFO level is 3</description>
                                        <value>2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level4</name>
                                        <description>Interrupt trigger when FIFO level is 4</description>
                                        <value>3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level5</name>
                                        <description>Interrupt trigger when FIFO level is 5</description>
                                        <value>4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level6</name>
                                        <description>Interrupt trigger when FIFO level is 6</description>
                                        <value>5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level7</name>
                                        <description>Interrupt trigger when FIFO level is 7</description>
                                        <value>6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level8</name>
                                        <description>Interrupt trigger when FIFO level is 8</description>
                                        <value>7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level9</name>
                                        <description>Interrupt trigger when FIFO level is 9</description>
                                        <value>8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level10</name>
                                        <description>Interrupt trigger when FIFO level is 10</description>
                                        <value>9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level11</name>
                                        <description>Interrupt trigger when FIFO level is 11</description>
                                        <value>10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level12</name>
                                        <description>Interrupt trigger when FIFO level is 12</description>
                                        <value>11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level13</name>
                                        <description>Interrupt trigger when FIFO level is 13</description>
                                        <value>12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level14</name>
                                        <description>Interrupt trigger when FIFO level is 14</description>
                                        <value>13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level15</name>
                                        <description>Interrupt trigger when FIFO level is 15</description>
                                        <value>14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>level16</name>
                                        <description>Interrupt trigger when FIFO level is 16</description>
                                        <value>15</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>tfcr</name>
                        <description>Transmit FIFO Configuration Register</description>
                        <addressOffset>0x2c</addressOffset>
                        <fields>
                            <field>
                                <name>txchet</name>
                                <description>Trigger level in the TX FIFO at which the transmitter data available interrupt generate</description>
                                <bitRange>[3:0]</bitRange>
                                <enumeratedValues derivedFrom = "rfcr.rxchdt.LEVEL">
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>rff</name>
                        <description>Receive FIFO Flush Register</description>
                        <addressOffset>0x30</addressOffset>
                        <fields>
                            <field>
                                <name>rxchfr</name>
                                <description>Receiver channel FIFO reset</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues>
                                    <name>FLUSH</name>
                                    <enumeratedValue>
                                        <name>not_flush</name>
                                        <description>Not flush an individual FIFO</description>
                                        <value>0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>flush</name>
                                        <description>Flush an indiviadual FIFO</description>
                                        <value>1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>tff</name>
                        <description>Transmit FIFO Flush Register</description>
                        <addressOffset>0x34</addressOffset>
                        <fields>
                            <field>
                                <name>rtxchfr</name>
                                <description>Transmit channel FIFO reset</description>
                                <bitRange>[0:0]</bitRange>
                                <enumeratedValues derivedFrom="rff.rxchfr.FLUSH">
                                </enumeratedValues>
                            </field>
                        </fields>
                    </register>
                    <register>
                        <name>_reserved%s</name>
                        <description>_RESERVED0</description>
                        <addressOffset>0x38</addressOffset>
                        <dim>2</dim>
                        <dimIndex>0-1</dimIndex>
                        <dimIncrement>0x4</dimIncrement>
                    </register>
                </cluster>
                <register>
                    <!-- TODO -->
                    <name>rxdma</name>
                    <description>Receiver Block DMA Register</description>
                    <addressOffset>0x1c0</addressOffset>
                </register>
                <register>
                    <!-- TODO -->
                    <name>rrxdma</name>
                    <description>Reset Receiver Block DMA Register</description>
                    <addressOffset>0x1c4</addressOffset>
                </register>
                <register>
                    <!-- TODO -->
                    <name>txdma</name>
                    <description>Transmitter Block DMA Register</description>
                    <addressOffset>0x1c8</addressOffset>
                </register>
                <register>
                    <!-- TODO -->
                    <name>rtxdma</name>
                    <description>Reset Transmitter Block DMA Register</description>
                    <addressOffset>0x1cc</addressOffset>
                </register>
                <register>
                    <name>i2s_comp_param_2</name>
                    <description>Component Parameter Register 2</description>
                    <addressOffset>0x1f0</addressOffset>
                </register>
                <register>
                    <name>i2s_comp_param_1</name>
                    <description>Component Parameter Register 1</description>
                    <addressOffset>0x1f4</addressOffset>
                </register>
                <register>
                    <name>i2s_comp_version_1</name>
                    <description>Component Version Register</description>
                    <addressOffset>0x1f8</addressOffset>
                </register>
                <register>
                    <name>i2s_comp_type</name>
                    <description>Component Type Register</description>
                    <addressOffset>0x1fc</addressOffset>
                </register>
