rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
        </peripheral>
        <!-- APU -->

        <!-- I2S1 -->
        <peripheral derivedFrom="I2S0">
            <name>I2S1</name>
            <description>Inter-Integrated Sound Interface 1</description>
            <baseAddress>0x50260000</baseAddress>
            <interrupt>
                <name>I2S1</name>
                <value>6</value>
            </interrupt>
        </peripheral>
        <!-- I2S1 -->

        <!-- I2S2 -->
        <peripheral derivedFrom="I2S0">
            <name>I2S2</name>
            <description>Inter-Integrated Sound Interface 2</description>
            <baseAddress>0x50270000</baseAddress>
            <interrupt>
                <name>I2S2</name>
                <value>7</value>
            </interrupt>
        </peripheral>
        <!-- I2S2 -->

        <!-- I2C0 -->
        <peripheral>
            <name>I2C0</name>
            <description>Inter-Integrated Circuit Bus 0</description>
            <groupName>I2C</groupName>
            <baseAddress>0x50280000</baseAddress>
            <registers>
                <register>
                    <name>con</name>
                    <description>Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>master_mode</name>
                            <description>Master Mode</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>speed</name>
                            <description>Speed</description>
                            <bitRange>[2:1]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>standard</name>
                                    <description>STANDARD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fast</name>
                                    <description>FAST</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>highspeed</name>
                                    <description>HIGHSPEED</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>addr_slave_width</name>
                            <description>Slave address width</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>b7</name>
                                    <description>7-bit address</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>b10</name>
                                    <description>10-bit address</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>restart_en</name>
                            <description>Enable Restart</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>slave_disable</name>
                            <description>Disable Slave</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>stop_det</name>
                            <description>STOP_DET_IFADDRESSED</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>tx_empty</name>
                            <description>TX_EMPTY_CTRL</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>tar</name>
                    <description>Target Address Register</description>
                    <addressOffset>0x04</addressOffset>
                    <fields>
                        <field>
                            <name>address</name>
                            <description>Target Address</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                        <field>
                            <name>gc</name>
                            <description>GC_OR_START</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>special</name>
                            <description>SPECIAL</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>addr_master_width</name>
                            <description>Master Address</description>
                            <bitRange>[12:12]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>b7</name>
                                    <description>7-bit address</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>b10</name>
                                    <description>10-bit address</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sar</name>
                    <description>Slave Address Register</description>
                    <addressOffset>0x08</addressOffset>
                    <fields>
                        <field>
                            <name>address</name>
                            <description>Slave Address</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>data_cmd</name>
                    <description>Data Buffer and Command Register</description>
                    <addressOffset>0x10</addressOffset>
                    <fields>
                        <field>
                            <name>cmd</name>
                            <description>CMD</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>data</name>
                            <description>Data</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ss_scl_hcnt</name>
                    <description>Standard Speed Clock SCL High Count Register</description>
                    <addressOffset>0x14</addressOffset>
                    <fields>
                        <field>
                            <name>count</name>
                            <description>COUNT</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ss_scl_lcnt</name>
                    <description>Standard Speed Clock SCL Low Count Register</description>
                    <addressOffset>0x18</addressOffset>
                    <fields>
                        <field>
                            <name>count</name>
                            <description>COUNT</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>intr_stat</name>
                    <description>Interrupt Status Register</description>
                    <addressOffset>0x2c</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>rx_under</name>
                            <description>RX_UNDER</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rx_over</name>
                            <description>RX_OVER</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>rx_full</name>
                            <description>RX_FULL</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>tx_over</name>
                            <description>TX_OVER</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>tx_empty</name>
                            <description>TX_EMPTY</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>rd_req</name>
                            <description>RD_REQ</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>tx_abrt</name>
                            <description>TX_ABRT</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>rx_done</name>
                            <description>RX_DONE</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>activity</name>
                            <description>ACTIVITY</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>stop_det</name>
                            <description>STOP_DET</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>start_det</name>
                            <description>START_DET</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>gen_call</name>
                            <description>GEN_CALL</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>intr_mask</name>
                    <description>Interrupt Mask Register</description>
                    <addressOffset>0x30</addressOffset>
                    <fields>
                        <field>
                            <name>rx_under</name>
                            <description>RX_UNDER</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rx_over</name>
                            <description>RX_OVER</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>rx_full</name>
                            <description>RX_FULL</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>tx_over</name>
                            <description>TX_OVER</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>tx_empty</name>
                            <description>TX_EMPTY</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>rd_req</name>
                            <description>RD_REQ</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>tx_abrt</name>
                            <description>TX_ABRT</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>rx_done</name>
                            <description>RX_DONE</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>activity</name>
                            <description>ACTIVITY</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>stop_det</name>
                            <description>STOP_DET</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>start_det</name>
                            <description>START_DET</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>gen_call</name>
                            <description>GEN_CALL</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>raw_intr_stat</name>
                    <description>Raw Interrupt Status Register</description>
                    <addressOffset>0x34</addressOffset>
                    <fields>
                        <field>
                            <name>rx_under</name>
                            <description>RX_UNDER</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rx_over</name>
                            <description>RX_OVER</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>rx_full</name>
                            <description>RX_FULL</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>tx_over</name>
                            <description>TX_OVER</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>tx_empty</name>
                            <description>TX_EMPTY</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>rd_req</name>
                            <description>RD_REQ</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>tx_abrt</name>
                            <description>TX_ABRT</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>rx_done</name>
                            <description>RX_DONE</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>activity</name>
                            <description>ACTIVITY</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>stop_det</name>
                            <description>STOP_DET</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>start_det</name>
                            <description>START_DET</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>gen_call</name>
                            <description>GEN_CALL</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rx_tl</name>
                    <description>Receive FIFO Threshold Register</description>
                    <addressOffset>0x38</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>tx_tl</name>
                    <description>Transmit FIFO Threshold Register</description>
                    <addressOffset>0x3c</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_intr</name>
                    <description>Clear Combined and Individual Interrupt Register</description>
                    <addressOffset>0x40</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_rx_under</name>
                    <description>Clear RX_UNDER Interrupt Register</description>
                    <addressOffset>0x44</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_rx_over</name>
                    <description>Clear RX_OVER Interrupt Register</description>
                    <addressOffset>0x48</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_tx_over</name>
                    <description>Clear TX_OVER Interrupt Register</description>
                    <addressOffset>0x4c</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_rd_req</name>
                    <description>Clear RD_REQ Interrupt Register</description>
                    <addressOffset>0x50</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_tx_abrt</name>
                    <description>Clear TX_ABRT Interrupt Register</description>
                    <addressOffset>0x54</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_rx_done</name>
                    <description>Clear RX_DONE Interrupt Register</description>
                    <addressOffset>0x58</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_activity</name>
                    <description>Clear ACTIVITY Interrupt Register</description>
                    <addressOffset>0x5c</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
