rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                <register>
                    <name>clr_stop_det</name>
                    <description>Clear STOP_DET Interrupt Register</description>
                    <addressOffset>0x60</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_start_det</name>
                    <description>Clear START_DET Interrupt Register</description>
                    <addressOffset>0x64</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clr_gen_call</name>
                    <description>I2C Clear GEN_CALL Interrupt Register</description>
                    <addressOffset>0x68</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>clr</name>
                            <description>CLR</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>enable</name>
                    <description>Enable Register</description>
                    <addressOffset>0x6c</addressOffset>
                    <fields>
                        <field>
                            <name>enable</name>
                            <description>ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>abort</name>
                            <description>ABORT</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>tx_cmd_block</name>
                            <description>TX_CMD_BLOCK</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>status</name>
                    <description>Status Register</description>
                    <addressOffset>0x70</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>activity</name>
                            <description>ACTIVITY</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>tfnf</name>
                            <description>TFNF</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>tfe</name>
                            <description>TFE</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>rfne</name>
                            <description>RFNE</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>rff</name>
                            <description>RFF</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>mst_activity</name>
                            <description>MST_ACTIVITY</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>slv_activity</name>
                            <description>SLV_ACTIVITY</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>txflr</name>
                    <description>Transmit FIFO Level Register</description>
                    <addressOffset>0x74</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rxflr</name>
                    <description>Receive FIFO Level Register</description>
                    <addressOffset>0x78</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sda_hold</name>
                    <description>SDA Hold Time Length Register</description>
                    <addressOffset>0x7c</addressOffset>
                    <fields>
                        <field>
                            <name>tx</name>
                            <description>TX</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>rx</name>
                            <description>RX</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>tx_abrt_source</name>
                    <description>Transmit Abort Source Register</description>
                    <addressOffset>0x80</addressOffset>
                    <fields>
                        <field>
                            <name>addr7_noack</name>
                            <description>7B_ADDR_NOACK</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>addr1_10_noack</name>
                            <description>10B_ADDR1_NOACK</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>addr2_10_noack</name>
                            <description>10B_ADDR2_NOACK</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>txdata_noack</name>
                            <description>TXDATA_NOACK</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>gcall_noack</name>
                            <description>GCALL_NOACK</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>gcall_read</name>
                            <description>GCALL_READ</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>hs_ackdet</name>
                            <description>HS_ACKDET</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>sbyte_ackdet</name>
                            <description>SBYTE_ACKDET</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>hs_norstrt</name>
                            <description>HS_NORSTRT</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>sbyte_norstrt</name>
                            <description>SBYTE_NORSTRT</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>rd_10_norstrt</name>
                            <description>10B_RD_NORSTRT</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>master_dis</name>
                            <description>MASTER_DIS</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>mst_arblost</name>
                            <description>MST_ARBLOST</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>slvflush_txfifo</name>
                            <description>SLVFLUSH_TXFIFO</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>slv_arblost</name>
                            <description>SLV_ARBLOST</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>slvrd_intx</name>
                            <description>SLVRD_INTX</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>user_abrt</name>
                            <description>USER_ABRT</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>dma_cr</name>
                    <description>I2C DMA Control Register</description>
                    <addressOffset>0x88</addressOffset>
                    <fields>
                        <field>
                            <name>RDMAE</name>
                            <description>RDMAE</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TDMAE</name>
                            <description>TDMAE</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>dma_tdlr</name>
                    <description>DMA Transmit Data Level Register</description>
                    <addressOffset>0x8c</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>dma_rdlr</name>
                    <description>DMA Receive Data Level Register</description>
                    <addressOffset>0x90</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sda_setup</name>
                    <description>SDA Setup Register</description>
                    <addressOffset>0x94</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>general_call</name>
                    <description>ACK General Call Register</description>
                    <addressOffset>0x98</addressOffset>
                    <fields>
                        <field>
                            <name>call_enable</name>
                            <description>CALL_ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>enable_status</name>
                    <description>Enable Status Register</description>
                    <addressOffset>0x9c</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>ic_enable</name>
                            <description>IC_ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>slv_dis_busy</name>
                            <description>SLV_DIS_BUSY</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>slv_rx_data_lost</name>
                            <description>SLV_RX_DATA_LOST</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>fs_spklen</name>
                    <description>SS, FS or FM+ spike suppression limit</description>
                    <addressOffset>0xa0</addressOffset>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>comp_param_1</name>
                    <description>Component Parameter Register 1</description>
                    <addressOffset>0xf4</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>apb_data_width</name>
                            <description>APB_DATA_WIDTH</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>max_speed_mode</name>
                            <description>MAX_SPEED_MODE</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>hc_count_values</name>
                            <description>HC_COUNT_VALUES</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>intr_io</name>
                            <description>INTR_IO</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>has_dma</name>
                            <description>HAS_DMA</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>encoded_params</name>
                            <description>ENCODED_PARAMS</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>rx_buffer_depth</name>
                            <description>RX_BUFFER_DEPTH</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>tx_buffer_depth</name>
                            <description>TX_BUFFER_DEPTH</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>comp_version</name>
                    <description>Component Version Register</description>
                    <addressOffset>0xf8</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>comp_type</name>
                    <description>Component Type Register</description>
                    <addressOffset>0xfc</addressOffset>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>value</name>
                            <description>VALUE</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
