rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>I2C0</name>
                <value>8</value>
            </interrupt>
        </peripheral>
        <!-- I2C0 -->

        <!-- I2C1 -->
        <peripheral derivedFrom="I2C0">
            <name>I2C1</name>
            <description>Inter-Integrated Circuit Bus 1</description>
            <baseAddress>0x50290000</baseAddress>
            <interrupt>
                <name>I2C1</name>
                <value>9</value>
            </interrupt>
        </peripheral>
        <!-- I2C1 -->

        <!-- I2C2 -->
        <peripheral derivedFrom="I2C0">
            <name>I2C2</name>
            <description>Inter-Integrated Circuit Bus 2</description>
            <baseAddress>0x502A0000</baseAddress>
            <interrupt>
                <name>I2C2</name>
                <value>10</value>
            </interrupt>
        </peripheral>
        <!-- I2C2 -->

        <!-- FPIOA -->
        <peripheral>
            <name>FPIOA</name>
            <description>Field Programmable IO Array</description>
            <groupName>FPIOA</groupName>
            <baseAddress>0x502B0000</baseAddress>
            <registers>
                <register>
                    <dim>48</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>io[%s]</name>
                    <description>FPIOA GPIO multiplexer io array</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>ch_sel</name>
                            <description>Channel select from 256 input</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>ds</name>
                            <description>Driving selector</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>oe_en</name>
                            <description>Static output enable, will AND with OE_INV</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>oe_inv</name>
                            <description>Invert output enable</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>do_sel</name>
                            <description>Data output select: 0 for DO, 1 for OE</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>do_inv</name>
                            <description>Invert the result of data output select (DO_SEL)</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>pu</name>
                            <description>Pull up enable. 0 for nothing, 1 for pull up</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>pd</name>
                            <description>Pull down enable. 0 for nothing, 1 for pull down</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>sl</name>
                            <description>Slew rate control enable</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>ie_en</name>
                            <description>Static input enable, will AND with IE_INV</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>ie_inv</name>
                            <description>Invert input enable</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>di_inv</name>
                            <description>Invert Data input</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>st</name>
                            <description>Schmitt trigger</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>pad_di</name>
                            <description>Read current IO's data input</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>tie_en[%s]</name>
                    <description>FPIOA GPIO multiplexer tie enable array</description>
                    <addressOffset>0xC0</addressOffset>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x04</dimIncrement>
                    <name>tie_val[%s]</name>
                    <description>FPIOA GPIO multiplexer tie value array</description>
                    <addressOffset>0xE0</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!-- FPIOA -->

        <!-- SHA256 -->
        <peripheral>
            <name>SHA256</name>
            <description>SHA256 Accelerator</description>
            <groupName>SHA256</groupName>
            <baseAddress>0x502C0000</baseAddress>
            <registers>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>result[%s]</name>
                    <description>Calculated SHA256 return value</description>
                    <addressOffset>0x00</addressOffset>
                </register>
                <register>
                    <name>data_in</name>
                    <description>SHA256 input data is written to this register</description>
                    <addressOffset>0x20</addressOffset>
                </register>
                <register>
                    <name>num_reg</name>
                    <description>Counters register</description>
                    <addressOffset>0x28</addressOffset>
                    <fields>
                        <field>
                            <name>data_cnt</name>
                            <description>The total amount of data calculated by SHA256 is set by this register, and the smallest unit is 512bit</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>data_num</name>
                            <description>Currently calculated block number. 512bit=1block</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>function_reg_0</name>
                    <description>Function configuration register 0</description>
                    <addressOffset>0x2C</addressOffset>
                    <fields>
                        <field>
                            <name>en</name>
                            <description>write:SHA256 enable register. read:Calculation completed flag</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>overflow</name>
                            <description>SHA256 calculation overflow flag</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>endian</name>
                            <description>Endian setting</description>
                            <bitRange>[16:16]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>le</name>
                                    <description>Little endian</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>be</name>
                                    <description>Big endian</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>function_reg_1</name>
                    <description>Function configuration register 1</description>
                    <addressOffset>0x34</addressOffset>
                    <fields>
                        <field>
                            <name>dma_en</name>
                            <description>SHA and DMA handshake signals enable. 1:enable; 0:disable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>fifo_in_full</name>
                            <description>1:SHA256 input fifo is full; 0:not full</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                    </fields>
                </register>
