rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>WDT0</name>
                <value>21</value>
            </interrupt>
        </peripheral>
        <!-- WDT0 -->

        <!-- WDT1 -->
        <peripheral derivedFrom="WDT0">
            <name>WDT1</name>
            <description>Watchdog Timer 1</description>
            <baseAddress>0x50410000</baseAddress>
            <interrupt>
                <name>WDT1</name>
                <value>22</value>
            </interrupt>
        </peripheral>
        <!-- WDT1 -->

        <!-- OTP -->
        <peripheral>
            <name>OTP</name>
            <description>One-Time Programmable Memory Controller</description>
            <groupName>OTP</groupName>
            <baseAddress>0x50420000</baseAddress>
            <registers>
                <!-- TODO -->
                <register>
                    <name>dummy</name>
                    <description>Dummy register: this peripheral is not implemented yet</description>
                    <addressOffset>0x00</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!-- OTP -->

        <!-- DVP -->
        <peripheral>
            <name>DVP</name>
            <description>Digital Video Port</description>
            <groupName>DVP</groupName>
            <baseAddress>0x50430000</baseAddress>
            <registers>
                <!-- TODO -->
                <register>
                    <name>dvp_cfg</name>
                    <description>Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <fields>
                        <field>
                            <name>start_int_enable</name>
                            <description>START_INT_ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>finish_int_enable</name>
                            <description>FINISH_INT_ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ai_output_enable</name>
                            <description>AI_OUTPUT_ENABLE</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>display_output_enable</name>
                            <description>DISPLAY_OUTPUT_ENABLE</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>auto_enable</name>
                            <description>AUTO_ENABLE</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>burst_size_4beats</name>
                            <description>BURST_SIZE_4BEATS</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>format</name>
                            <description>FORMAT</description>
                            <bitRange>[10:9]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>rgb</name>
                                    <description>RGB_FORMAT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>yuv</name>
                                    <description>YUV_FORMAT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>y</name>
                                    <description>Y_FORMAT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>href_burst_num</name>
                            <description>HREF_BURST_NUM</description>
                            <bitRange>[19:12]</bitRange>
                        </field>
                        <field>
                            <name>line_num</name>
                            <description>LINE_NUM</description>
                            <bitRange>[29:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>r_addr</name>
                    <description>R_ADDR</description>
                    <addressOffset>0x04</addressOffset>
                </register>
                <register>
                    <name>g_addr</name>
                    <description>G_ADDR</description>
                    <addressOffset>0x08</addressOffset>
                </register>
                <register>
                    <name>b_addr</name>
                    <description>B_ADDR</description>
                    <addressOffset>0x0c</addressOffset>
                </register>
                <register>
                    <name>cmos_cfg</name>
                    <description>CMOS Config Register</description>
                    <addressOffset>0x10</addressOffset>
                    <fields>
                        <field>
                            <name>clk_div</name>
                            <description>CLK_DIV</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>clk_enable</name>
                            <description>CLK_ENABLE</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>reset</name>
                            <description>RESET</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>power_down</name>
                            <description>POWER_DOWN</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sccb_cfg</name>
                    <description>SCCB Config Register</description>
                    <addressOffset>0x14</addressOffset>
                    <fields>
                        <field>
                            <name>byte_num</name>
                            <description>BYTE_NUM</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>num2</name>
                                    <description>BYTE_NUM_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>num3</name>
                                    <description>BYTE_NUM_3</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>num4</name>
                                    <description>BYTE_NUM_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>scl_lcnt</name>
                            <description>SCL_LCNT</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>scl_hcnt</name>
                            <description>SCL_HCNT</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>rdata</name>
                            <description>RDATA</description>
                            <bitRange>[31:24]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sccb_ctl</name>
                    <description>SCCB Control Register</description>
                    <addressOffset>0x18</addressOffset>
                    <fields>
                        <field>
                            <!-- WRITE_DATA_ENABLE -->
                            <name>device_address</name>
                            <description>DEVICE_ADDRESS</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>reg_address</name>
                            <description>REG_ADDRESS</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>wdata_byte0</name>
                            <description>WDATA_BYTE0</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>wdata_byte1</name>
                            <description>WDATA_BYTE1</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>axi</name>
                    <description>AXI Register</description>
                    <addressOffset>0x1c</addressOffset>
                    <fields>
                        <field>
                            <name>gm_mlen</name>
                            <description>GM_MLEN</description>
                            <bitRange>[7:0]</bitRange>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>byte1</name>
                                    <description>GM_MLEN_1BYTE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>byte4</name>
                                    <description>GM_MLEN_4BYTE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>sts</name>
                    <description>STS Register</description>
                    <addressOffset>0x20</addressOffset>
                    <fields>
                        <field>
                            <name>frame_start</name>
                            <description>FRAME_START</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>frame_start_we</name>
                            <description>FRAME_START_WE</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>frame_finish</name>
                            <description>FRAME_FINISH</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>frame_finish_we</name>
                            <description>FRAME_FINISH_WE</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>dvp_en</name>
                            <description>DVP_EN</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>dvp_en_we</name>
                            <description>DVP_EN_WE</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>sccb_en</name>
                            <description>SCCB_EN</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>sccb_en_we</name>
                            <description>SCCB_EN_WE</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>reverse</name>
                    <description>REVERSE</description>
                    <addressOffset>0x24</addressOffset>
                </register>
                <register>
                    <name>rgb_addr</name>
                    <description>RGB_ADDR</description>
                    <addressOffset>0x28</addressOffset>
                </register>
