rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
            </registers>
            <interrupt>
                <name>DVP</name>
                <value>24</value>
            </interrupt>
        </peripheral>
        <!-- DVP -->

        <!-- SYSCTL -->
        <peripheral>
            <name>SYSCTL</name>
            <description>System Controller</description>
            <groupName>SYSCTL</groupName>
            <baseAddress>0x50440000</baseAddress>
            <registers>
                <register>
                    <name>git_id</name>
                    <description>Git short commit id</description>
                    <addressOffset>0x00</addressOffset>
                </register>
                <register>
                    <name>clk_freq</name>
                    <description>System clock base frequency</description>
                    <addressOffset>0x04</addressOffset>
                </register>
                <register>
                    <name>pll0</name>
                    <description>PLL0 controller</description>
                    <addressOffset>0x08</addressOffset>
                    <fields>
                        <field>
                            <name>clkr</name>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>clkf</name>
                            <bitRange>[9:4]</bitRange>
                        </field>
                        <field>
                            <name>clkod</name>
                            <bitRange>[13:10]</bitRange>
                        </field>
                        <field>
                            <name>bwadj</name>
                            <bitRange>[19:14]</bitRange>
                        </field>
                        <field>
                            <name>reset</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>pwrd</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>intfb</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>bypass</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>test</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>out_en</name>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>test_en</name>
                            <bitRange>[26:26]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>pll1</name>
                    <description>PLL1 controller</description>
                    <addressOffset>0x0c</addressOffset>
                    <fields>
                        <field>
                            <name>clkr</name>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>clkf</name>
                            <bitRange>[9:4]</bitRange>
                        </field>
                        <field>
                            <name>clkod</name>
                            <bitRange>[13:10]</bitRange>
                        </field>
                        <field>
                            <name>bwadj</name>
                            <bitRange>[19:14]</bitRange>
                        </field>
                        <field>
                            <name>reset</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>pwrd</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>intfb</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>bypass</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>test</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>out_en</name>
                            <bitRange>[25:25]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>pll2</name>
                    <description>PLL2 controller</description>
                    <addressOffset>0x10</addressOffset>
                    <fields>
                        <field>
                            <name>clkr</name>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>clkf</name>
                            <bitRange>[9:4]</bitRange>
                        </field>
                        <field>
                            <name>clkod</name>
                            <bitRange>[13:10]</bitRange>
                        </field>
                        <field>
                            <name>bwadj</name>
                            <bitRange>[19:14]</bitRange>
                        </field>
                        <field>
                            <name>reset</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>pwrd</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>intfb</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>bypass</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>test</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>out_en</name>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>ckin_sel</name>
                            <bitRange>[27:26]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>pll_lock</name>
                    <description>PLL lock tester</description>
                    <addressOffset>0x18</addressOffset>
                    <fields>
                        <field>
                            <name>pll_lock0</name>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>pll_slip_clear0</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>test_clk_out0</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>pll_lock1</name>
                            <bitRange>[9:8]</bitRange>
                        </field>
                        <field>
                            <name>pll_slip_clear1</name>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>test_clk_out1</name>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>pll_lock2</name>
                            <bitRange>[17:16]</bitRange>
                        </field>
                        <field>
                            <name>pll_slip_clear2</name>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>test_clk_out2</name>
                            <bitRange>[19:19]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>rom_error</name>
                    <description>AXI ROM detector</description>
                    <addressOffset>0x1c</addressOffset>
                    <fields>
                        <field>
                            <name>rom_mul_error</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>rom_one_error</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_sel0</name>
                    <description>Clock select controller 0</description>
                    <addressOffset>0x20</addressOffset>
                    <fields>
                        <field>
                            <name>aclk_sel</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>aclk_divider_sel</name>
                            <bitRange>[2:1]</bitRange>
                        </field>
                        <field>
                            <name>apb0_clk_sel</name>
                            <bitRange>[5:3]</bitRange>
                        </field>
                        <field>
                            <name>apb1_clk_sel</name>
                            <bitRange>[8:6]</bitRange>
                        </field>
                        <field>
                            <name>apb2_clk_sel</name>
                            <bitRange>[11:9]</bitRange>
                        </field>
                        <field>
                            <name>spi3_clk_sel</name>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>timer0_clk_sel</name>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>timer1_clk_sel</name>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>timer2_clk_sel</name>
                            <bitRange>[15:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_sel1</name>
                    <description>Clock select controller 1</description>
                    <addressOffset>0x24</addressOffset>
                    <fields>
                        <field>
                            <name>spi3_sample_clk_sel</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_en_cent</name>
                    <description>Central clock enable</description>
                    <addressOffset>0x28</addressOffset>
                    <fields>
                        <field>
                            <name>cpu_clk_en</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>sram0_clk_en</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>sram1_clk_en</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>apb0_clk_en</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>apb1_clk_en</name>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>apb2_clk_en</name>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_en_peri</name>
                    <description>Peripheral clock enable</description>
                    <addressOffset>0x2c</addressOffset>
                    <fields>
                        <field>
                            <name>rom_clk_en</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>dma_clk_en</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ai_clk_en</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>dvp_clk_en</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>fft_clk_en</name>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>gpio_clk_en</name>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>spi0_clk_en</name>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>spi1_clk_en</name>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>spi2_clk_en</name>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>spi3_clk_en</name>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>i2s0_clk_en</name>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>i2s1_clk_en</name>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>i2s2_clk_en</name>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>i2c0_clk_en</name>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>i2c1_clk_en</name>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>i2c2_clk_en</name>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>uart1_clk_en</name>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>uart2_clk_en</name>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>uart3_clk_en</name>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>aes_clk_en</name>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>fpioa_clk_en</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>timer0_clk_en</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>timer1_clk_en</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>timer2_clk_en</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>wdt0_clk_en</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>wdt1_clk_en</name>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>sha_clk_en</name>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>otp_clk_en</name>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>rtc_clk_en</name>
                            <bitRange>[29:29]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>soft_reset</name>
                    <description>Soft reset ctrl</description>
                    <addressOffset>0x30</addressOffset>
                    <fields>
                        <field>
                            <name>soft_reset</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
