rcore-os/rCore-Tutorial-v3/third-party/k210-pac/k210.svd
                <register>
                    <name>peri_reset</name>
                    <description>Peripheral reset controller</description>
                    <addressOffset>0x34</addressOffset>
                    <fields>
                        <field>
                            <name>rom_reset</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>dma_reset</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ai_reset</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>dvp_reset</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>fft_reset</name>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>gpio_reset</name>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>spi0_reset</name>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>spi1_reset</name>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>spi2_reset</name>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>spi3_reset</name>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>i2s0_reset</name>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>i2s1_reset</name>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>i2s2_reset</name>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>i2c0_reset</name>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>i2c1_reset</name>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>i2c2_reset</name>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>uart1_reset</name>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>uart2_reset</name>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>uart3_reset</name>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>aes_reset</name>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>fpioa_reset</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>timer0_reset</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>timer1_reset</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>timer2_reset</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>wdt0_reset</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>wdt1_reset</name>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>sha_reset</name>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>rtc_reset</name>
                            <bitRange>[29:29]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th0</name>
                    <description>Clock threshold controller 0</description>
                    <addressOffset>0x38</addressOffset>
                    <fields>
                        <field>
                            <name>sram0_gclk</name>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>sram1_gclk</name>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>ai_gclk</name>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>dvp_gclk</name>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>rom_gclk</name>
                            <bitRange>[19:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th1</name>
                    <description>Clock threshold controller 1</description>
                    <addressOffset>0x3c</addressOffset>
                    <fields>
                        <field>
                            <name>spi0_clk</name>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>spi1_clk</name>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>spi2_clk</name>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>spi3_clk</name>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th2</name>
                    <description>Clock threshold controller 2</description>
                    <addressOffset>0x40</addressOffset>
                    <fields>
                        <field>
                            <name>timer0_clk</name>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>timer1_clk</name>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>timer2_clk</name>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th3</name>
                    <description>Clock threshold controller 3</description>
                    <addressOffset>0x44</addressOffset>
                    <fields>
                        <field>
                            <name>i2s0_clk</name>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>i2s1_clk</name>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th4</name>
                    <description>Clock threshold controller 4</description>
                    <addressOffset>0x48</addressOffset>
                    <fields>
                        <field>
                            <name>i2s2_clk</name>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>i2s0_mclk</name>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>i2s1_mclk</name>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th5</name>
                    <description>Clock threshold controller 5</description>
                    <addressOffset>0x4c</addressOffset>
                    <fields>
                        <field>
                            <name>i2s2_mclk</name>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>i2c0_clk</name>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>i2c1_clk</name>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>i2c2_clk</name>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>clk_th6</name>
                    <description>Clock threshold controller 6</description>
                    <addressOffset>0x50</addressOffset>
                    <fields>
                        <field>
                            <name>wdt0_clk</name>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>wdt1_clk</name>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>misc</name>
                    <description>Miscellaneous controller</description>
                    <addressOffset>0x54</addressOffset>
                    <fields>
                        <field>
                            <name>debug_sel</name>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>spi_dvp_data_enable</name>
                            <bitRange>[10:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>peri</name>
                    <description>Peripheral controller</description>
                    <addressOffset>0x58</addressOffset>
                    <fields>
                        <field>
                            <name>timer0_pause</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>timer1_pause</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>timer2_pause</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>timer3_pause</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>timer4_pause</name>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>timer5_pause</name>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>timer6_pause</name>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>timer7_pause</name>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>timer8_pause</name>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>timer9_pause</name>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>timer10_pause</name>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>timer11_pause</name>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>spi0_xip_en</name>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>spi1_xip_en</name>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>spi2_xip_en</name>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>spi3_xip_en</name>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>spi0_clk_bypass</name>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>spi1_clk_bypass</name>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>spi2_clk_bypass</name>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>i2s0_clk_bypass</name>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>i2s1_clk_bypass</name>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>i2s2_clk_bypass</name>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>jtag_clk_bypass</name>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>dvp_clk_bypass</name>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>debug_clk_bypass</name>
                            <bitRange>[24:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>spi_sleep</name>
                    <description>SPI sleep controller</description>
                    <addressOffset>0x5c</addressOffset>
                    <fields>
                        <field>
                            <name>ssi0_sleep</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>ssi1_sleep</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>ssi2_sleep</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>ssi3_sleep</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>reset_status</name>
                    <description>Reset source status</description>
                    <addressOffset>0x60</addressOffset>
                    <fields>
                        <field>
                            <name>reset_sts_clr</name>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>pin_reset_sts</name>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>wdt0_reset_sts</name>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>wdt1_reset_sts</name>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>soft_reset_sts</name>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>dma_sel0</name>
                    <description>DMA handshake selector</description>
                    <addressOffset>0x64</addressOffset>
                    <fields>
                        <field>
                            <name>dma_sel0</name>
                            <bitRange>[5:0]</bitRange>
                            <enumeratedValues>
                            <name>DMASELECT</name>
                                <enumeratedValue><name>ssi0_rx_req</name><value>0</value></enumeratedValue>
                                <enumeratedValue><name>ssi0_tx_req</name><value>1</value></enumeratedValue>
                                <enumeratedValue><name>ssi1_rx_req</name><value>2</value></enumeratedValue>
                                <enumeratedValue><name>ssi1_tx_req</name><value>3</value></enumeratedValue>
                                <enumeratedValue><name>ssi2_rx_req</name><value>4</value></enumeratedValue>
                                <enumeratedValue><name>ssi2_tx_req</name><value>5</value></enumeratedValue>
                                <enumeratedValue><name>ssi3_rx_req</name><value>6</value></enumeratedValue>
                                <enumeratedValue><name>ssi3_tx_req</name><value>7</value></enumeratedValue>
                                <enumeratedValue><name>i2c0_rx_req</name><value>8</value></enumeratedValue>
                                <enumeratedValue><name>i2c0_tx_req</name><value>9</value></enumeratedValue>
                                <enumeratedValue><name>i2c1_rx_req</name><value>10</value></enumeratedValue>
                                <enumeratedValue><name>i2c1_tx_req</name><value>11</value></enumeratedValue>
                                <enumeratedValue><name>i2c2_rx_req</name><value>12</value></enumeratedValue>
                                <enumeratedValue><name>i2c2_tx_req</name><value>13</value></enumeratedValue>
                                <enumeratedValue><name>uart1_rx_req</name><value>14</value></enumeratedValue>
                                <enumeratedValue><name>uart1_tx_req</name><value>15</value></enumeratedValue>
                                <enumeratedValue><name>uart2_rx_req</name><value>16</value></enumeratedValue>
                                <enumeratedValue><name>uart2_tx_req</name><value>17</value></enumeratedValue>
                                <enumeratedValue><name>uart3_rx_req</name><value>18</value></enumeratedValue>
                                <enumeratedValue><name>uart3_tx_req</name><value>19</value></enumeratedValue>
                                <enumeratedValue><name>aes_req</name><value>20</value></enumeratedValue>
                                <enumeratedValue><name>sha_rx_req</name><value>21</value></enumeratedValue>
                                <enumeratedValue><name>ai_rx_req</name><value>22</value></enumeratedValue>
                                <enumeratedValue><name>fft_rx_req</name><value>23</value></enumeratedValue>
                                <enumeratedValue><name>fft_tx_req</name><value>24</value></enumeratedValue>
                                <enumeratedValue><name>i2s0_tx_req</name><value>25</value></enumeratedValue>
                                <enumeratedValue><name>i2s0_rx_req</name><value>26</value></enumeratedValue>
                                <enumeratedValue><name>i2s1_tx_req</name><value>27</value></enumeratedValue>
                                <enumeratedValue><name>i2s1_rx_req</name><value>28</value></enumeratedValue>
                                <enumeratedValue><name>i2s2_tx_req</name><value>29</value></enumeratedValue>
                                <enumeratedValue><name>i2s2_rx_req</name><value>30</value></enumeratedValue>
                                <enumeratedValue><name>i2s0_bf_dir_req</name><value>31</value></enumeratedValue>
                                <enumeratedValue><name>i2s0_bf_voice_req</name><value>32</value></enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>dma_sel1</name>
                            <bitRange>[11:6]</bitRange>
                            <enumeratedValues derivedFrom = "DMASELECT">
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>dma_sel2</name>
                            <bitRange>[17:12]</bitRange>
                            <enumeratedValues derivedFrom = "DMASELECT">
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>dma_sel3</name>
                            <bitRange>[23:18]</bitRange>
                            <enumeratedValues derivedFrom = "DMASELECT">
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>dma_sel4</name>
                            <bitRange>[29:24]</bitRange>
                            <enumeratedValues derivedFrom = "DMASELECT">
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
